Revit 2025 API
ParameterTypeId.RebarFreeFormHookEndPlaneAngle Property
 "Hook Orientation At End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarFreeFormHookEndPlaneAngle { get; }
Public Shared ReadOnly Property RebarFreeFormHookEndPlaneAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarFreeFormHookEndPlaneAngle {
	ForgeTypeId^ get ();
}
static member RebarFreeFormHookEndPlaneAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace